from dataclasses import dataclass


DEFAULT_ENGLISH_CHARSET = {
    i: c for i, c in enumerate([
        " ", "0", "1", "2", "3", "4", "5", "6", "7", "8", "9",
        "A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K",
        "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V",
        "W", "X", "Y", "Z", "a", "b", "c", "d", "e", "f", "g",
        "h", "i", "j", "k", "l", "m", "n", "o", "p", "q", "r",
        "s", "t", "u", "v", "w", "x", "y", "z", "*", ".", ",",
        "?", "!", "/", "<", ">", ":", "-", "'", "\"", "%", "#",
        "&", "(", ")", "=", "↖", "↗", "↘", "↙"
    ])
}

DEFAULT_FRENCH_CHARSET = {
    i: c for i, c in enumerate([
        " ", "0", "1", "2", "3", "4", "5", "6", "7", "8", "9",
        "A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K",
        "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V",
        "W", "X", "Y", "Z", "a", "b", "c", "d", "e", "f", "g",
        "h", "i", "j", "k", "l", "m", "n", "o", "p", "q", "r",
        "s", "t", "u", "v", "w", "x", "y", "z", "*", ".", ",",
        "?", "!", "/", "<", ">", ":", "-", "'", "\"", "%", "#",
        "&", "(", ")", "=", "è", "á", "à", "ù", "â", "ê", "î",
        "ô", "û", "ç", "ü", ";", "`"
    ])
}

DEFAULT_GERMAN_CHARSET = {
    i: c for i, c in enumerate([
        " ", "0", "1", "2", "3", "4", "5", "6", "7", "8", "9",
        "A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K",
        "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V",
        "W", "X", "Y", "Z", "*", ".", ",", "?", "!", "/", "<",
        ">", ":", "-", "\'", "\"", "%", "#", "&", "(", ")", "=",
        "↖", "↗", "↘", "↙", "Ä", "Ö", "Ü", "ß"
    ])
}

DEFAULT_JAPANESE_CHARSET = {
    i: c for i, c in enumerate([
        "　", "0", "1", "2", "3", "4", "5", "6", "7", "8", "9", "あ",
        "い", "う", "え", "お", "か", "き", "く", "け", "こ", "さ", "し",
        "す", "せ", "そ", "た", "ち", "つ", "て", "と", "な", "に",
        "ぬ", "ね", "の", "は", "ひ", "ふ", "へ", "ほ", "ま", "み", "む",
        "め", "も", "や", "ゆ", "よ", "ら", "り", "る", "れ", "ろ", "わ",
        "を", "ん", "ぁ", "ぃ", "ぅ", "ぇ", "ぉ", "ゃ", "ゅ", "ょ", "ゎ",
        "ア", "イ", "ウ", "エ", "オ", "カ", "キ", "ク", "ケ", "コ", "サ",
        "シ", "ス", "セ", "ソ", "タ", "チ", "ツ", "テ", "ト", "ナ", "ニ",
        "ヌ", "ネ", "ノ", "ハ", "ヒ", "フ", "ヘ", "ホ", "マ", "ミ", "ム",
        "メ", "モ", "ヤ", "ユ", "ヨ", "ラ", "リ", "ル", "レ", "ロ", "ワ",
        "ヲ", "ン", "ァ", "ィ", "ゥ", "ェ", "ォ", "ャ", "ュ", "ョ", "ッ",
        "、", "。", "゛", "゜", "ー", "！", "？", "※", "東", "西", "南",
        "北", "上", "中", "下", "道", "具", "屋", "教", "会", "宿", "神",
        "父", "冒", "険", "記", "録", "毒", "呪", "治", "療", "金", "貨",
        "枚", "買", "階", "本", "売", "泊", "客", "品", "男", "女", "子",
        "供", "人", "族", "殿", "公", "爵", "領", "主", "兵", "悪", "霊",
        "年", "月", "日", "財", "宝", "地", "図", "実", "灯", "台", "家",
        "店", "町", "村", "滝", "岬", "島", "海", "沼", "湖", "港", "城",
        "塔", "森", "橋", "団", "気", "船", "箱", "魔", "命", "危", "美",
        "長", "古", "老", "作", "名", "商", "大", "・", "「", "」", "↘",
        "↖", "↙", "↗", "王", "剣", "士", "国", "本", "法", "Ａ", "Ｂ",
        "Ｃ", "．", "╳"
    ])
}

JAPANESE_DIACRITIC_MAP = {
    "゛": {
        "か": "が", "き": "ぎ", "く": "ぐ", "け": "げ", "こ": "ご", "さ": "ざ", "し": "じ",
        "す": "ず", "せ": "ぜ", "そ": "ぞ", "た": "だ", "ち": "ぢ", "つ": "づ", "て": "で",
        "と": "ど", "は": "ば", "ひ": "び", "ふ": "ぶ", "へ": "べ", "ほ": "ぼ", "カ": "ガ",
        "キ": "ギ", "ク": "グ", "ケ": "ゲ", "コ": "ゴ", "サ": "ザ", "シ": "ジ", "ス": "ズ",
        "セ": "ゼ", "ソ": "ゾ", "タ": "ダ", "チ": "ヂ", "ツ": "ヅ", "テ": "デ", "ト": "ド",
        "ハ": "バ", "ヒ": "ビ", "フ": "ブ", "ヘ": "ベ", "ホ": "ボ", "ウ": "ヴ"
    },
    "゜": {
        "は": "ぱ", "ひ": "ぴ", "ふ": "ぷ", "へ": "ぺ", "ほ": "ぽ", "ハ": "パ", "ヒ": "ピ",
        "フ": "プ", "ヘ": "ペ", "ホ": "ポ"
    }
}

@dataclass
class Charset:
    charset: dict[int, str]
    diacritic_map: dict[dict[str, str]]
    eof_char: int

    def __post_init__(self):
        self.reverse_charset = {char: code for code, char in self.charset.items()}
        self.reverse_diacritic_map = {char: symbol+orgchar for symbol, accdict in self.diacritic_map.items() for orgchar, char in accdict.items()}

CHARSETS = {
    "ENGLISH": Charset(DEFAULT_ENGLISH_CHARSET, {}, 0x55),
    "FRENCH": Charset(DEFAULT_FRENCH_CHARSET, {}, 0x64),
    "GERMAN": Charset(DEFAULT_GERMAN_CHARSET, {}, 0x41),
    "JAPANESE": Charset(DEFAULT_JAPANESE_CHARSET, JAPANESE_DIACRITIC_MAP, 0xE9),
}
